feat: update docs to use mermaid
